[Killed] BlockStatement
game/match-pile/rules/isValid.ts:14:35
 
 export function isValid(state: PileState): boolean {
   const ids = new Set<string>();
-  for (const tile of state.tiles) {
-    if (ids.has(tile.id)) return false;
-    ids.add(tile.id);
-  }
+  for (const tile of state.tiles) {}
 
   const cells = new Set<string>();
killedBy: Match Pile rules — reference & production spec isValid — rejects a state with duplicate tile ids
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
game/match-pile/rules/isValid.ts:15:9
 export function isValid(state: PileState): boolean {
   const ids = new Set<string>();
   for (const tile of state.tiles) {
-    if (ids.has(tile.id)) return false;
+    if (false) return false;
     ids.add(tile.id);
   }
killedBy: Match Pile rules — reference & production spec isValid — rejects a state with duplicate tile ids
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
game/match-pile/rules/isValid.ts:15:34
 export function isValid(state: PileState): boolean {
   const ids = new Set<string>();
   for (const tile of state.tiles) {
-    if (ids.has(tile.id)) return false;
+    if (ids.has(tile.id)) return true;
     ids.add(tile.id);
   }
killedBy: Match Pile rules — reference & production spec isValid — rejects a state with duplicate tile ids
statusReason: expected true to be false // Object.is equality

[Killed] CallExpression
game/match-pile/rules/isValid.ts:16:5
   const ids = new Set<string>();
   for (const tile of state.tiles) {
     if (ids.has(tile.id)) return false;
-    ids.add(tile.id);
+    ;
   }
 
killedBy: Match Pile rules — reference & production spec isValid — rejects a state with duplicate tile ids
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
game/match-pile/rules/isValid.ts:20:35
   }
 
   const cells = new Set<string>();
-  for (const tile of state.tiles) {
-    const key = `${tile.col},${tile.row},${tile.layer}`;
-    if (cells.has(key)) return false;
-    cells.add(key);
-  }
+  for (const tile of state.tiles) {}
 
   if (state.tray.length > TRAY_SIZE) return false;
killedBy: Match Pile rules — reference & production spec isValid — rejects a state with two different tiles at the same (col,row,layer)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
game/match-pile/rules/isValid.ts:22:32
   const cells = new Set<string>();
   for (const tile of state.tiles) {
     const key = `${tile.col},${tile.row},${tile.layer}`;
-    if (cells.has(key)) return false;
+    if (cells.has(key)) return true;
     cells.add(key);
   }
killedBy: Match Pile rules — reference & production spec isValid — rejects a state with two different tiles at the same (col,row,layer)
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
game/match-pile/rules/isValid.ts:22:9
   const cells = new Set<string>();
   for (const tile of state.tiles) {
     const key = `${tile.col},${tile.row},${tile.layer}`;
-    if (cells.has(key)) return false;
+    if (true) return false;
     cells.add(key);
   }
killedBy: Match Pile rules — reference & production spec invariants — production step preserves rules invariants across a random walk, including terminal absorption (R-TERMINAL)
statusReason: Property failed after 1 tests
{ seed: 1178063371, path: "0:0:0:0:0:0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"tiles":[{"id":"t0","typeId":"A","col":0,"row":0,"layer":0}],"tray":[],"cleared":0,"phase":"playing"},[true,false,false,false,false,false,false,false,false,false],[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]]
Shrunk 26 time(s)

Hint: Enable verbose mo

[Killed] CallExpression
game/match-pile/rules/isValid.ts:23:5
   for (const tile of state.tiles) {
     const key = `${tile.col},${tile.row},${tile.layer}`;
     if (cells.has(key)) return false;
-    cells.add(key);
+    ;
   }
 
killedBy: Match Pile rules — reference & production spec isValid — rejects a state with two different tiles at the same (col,row,layer)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
game/match-pile/rules/isValid.ts:26:7
     cells.add(key);
   }
 
-  if (state.tray.length > TRAY_SIZE) return false;
+  if (state.tray.length >= TRAY_SIZE) return false;
 
   const typeCounts = new Map<string, number>();
killedBy: Match Pile rules — reference & production spec invariants — production step preserves rules invariants across a random walk, including terminal absorption (R-TERMINAL)
statusReason: Property failed after 4 tests
{ seed: -787643880, path: "3:4:4:6:6:9:10:11:11:1:1:2:2:2:6:6:6:6:6:6:6:6:6:6:6:6:11:10:6:6:6:6:6:6:6:6:6:6", endOnFailure: true }
Counterexample: [{"tiles":[{"id":"t0","typeId":"A","col":0,"row":0,"layer":0},{"id":"t1","typeId":"B","col":0,"row":0,"layer":1}],"tray":["A","B","C","D","D"],"cleared":0,"phase":"playing"},[false,false,false,false,false,false,false,false,

[Killed] ConditionalExpression
game/match-pile/rules/isValid.ts:26:7
     cells.add(key);
   }
 
-  if (state.tray.length > TRAY_SIZE) return false;
+  if (false) return false;
 
   const typeCounts = new Map<string, number>();
killedBy: Match Pile rules — reference & production spec isValid — rejects a tray longer than TRAY_SIZE
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
game/match-pile/rules/isValid.ts:29:36
   if (state.tray.length > TRAY_SIZE) return false;
 
   const typeCounts = new Map<string, number>();
-  for (const typeId of state.tray) {
-    const next = (typeCounts.get(typeId) ?? 0) + 1;
-    if (next >= MATCH_SIZE) return false;
-    typeCounts.set(typeId, next);
-  }
+  for (const typeId of state.tray) {}
 
   if (state.cleared < 0 || state.cleared % MATCH_SIZE !== 0) return false;
killedBy: Match Pile rules — reference & production spec isValid — rejects a tray holding a typeId at exactly MATCH_SIZE copies (the clear boundary)
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
game/match-pile/rules/isValid.ts:30:18
 
   const typeCounts = new Map<string, number>();
   for (const typeId of state.tray) {
-    const next = (typeCounts.get(typeId) ?? 0) + 1;
+    const next = (typeCounts.get(typeId) ?? 0) - 1;
     if (next >= MATCH_SIZE) return false;
     typeCounts.set(typeId, next);
killedBy: Match Pile rules — reference & production spec isValid — rejects a tray holding a typeId at exactly MATCH_SIZE copies (the clear boundary)
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
game/match-pile/rules/isValid.ts:30:19
 
   const typeCounts = new Map<string, number>();
   for (const typeId of state.tray) {
-    const next = (typeCounts.get(typeId) ?? 0) + 1;
+    const next = (typeCounts.get(typeId) && 0) + 1;
     if (next >= MATCH_SIZE) return false;
     typeCounts.set(typeId, next);
killedBy: Match Pile rules — reference & production spec isValid — rejects a tray holding a typeId at exactly MATCH_SIZE copies (the clear boundary)
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
game/match-pile/rules/isValid.ts:31:9
   const typeCounts = new Map<string, number>();
   for (const typeId of state.tray) {
     const next = (typeCounts.get(typeId) ?? 0) + 1;
-    if (next >= MATCH_SIZE) return false;
+    if (next > MATCH_SIZE) return false;
     typeCounts.set(typeId, next);
   }
killedBy: Match Pile rules — reference & production spec isValid — rejects a tray holding a typeId at exactly MATCH_SIZE copies (the clear boundary)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
game/match-pile/rules/isValid.ts:31:36
   const typeCounts = new Map<string, number>();
   for (const typeId of state.tray) {
     const next = (typeCounts.get(typeId) ?? 0) + 1;
-    if (next >= MATCH_SIZE) return false;
+    if (next >= MATCH_SIZE) return true;
     typeCounts.set(typeId, next);
   }
killedBy: Match Pile rules — reference & production spec isValid — rejects a tray holding a typeId at exactly MATCH_SIZE copies (the clear boundary)
statusReason: expected true to be false // Object.is equality

[Killed] CallExpression
game/match-pile/rules/isValid.ts:32:5
   for (const typeId of state.tray) {
     const next = (typeCounts.get(typeId) ?? 0) + 1;
     if (next >= MATCH_SIZE) return false;
-    typeCounts.set(typeId, next);
+    ;
   }
 
killedBy: Match Pile rules — reference & production spec isValid — rejects a tray holding a typeId at exactly MATCH_SIZE copies (the clear boundary)
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
game/match-pile/rules/isValid.ts:35:28
     typeCounts.set(typeId, next);
   }
 
-  if (state.cleared < 0 || state.cleared % MATCH_SIZE !== 0) return false;
+  if (state.cleared < 0 || state.cleared * MATCH_SIZE !== 0) return false;
 
   if (state.tiles.length === 0 && state.phase !== "won") return false;
killedBy: Match Pile rules — reference & production spec R-GEN-SOLVABLE (seed=42) generates a solvable easy puzzle
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
game/match-pile/rules/isValid.ts:35:7
     typeCounts.set(typeId, next);
   }
 
-  if (state.cleared < 0 || state.cleared % MATCH_SIZE !== 0) return false;
+  if (state.cleared >= 0 || state.cleared % MATCH_SIZE !== 0) return false;
 
   if (state.tiles.length === 0 && state.phase !== "won") return false;
killedBy: Match Pile rules — reference & production spec R-GEN-SOLVABLE (seed=42) generates a solvable easy puzzle
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
game/match-pile/rules/isValid.ts:37:7
 
   if (state.cleared < 0 || state.cleared % MATCH_SIZE !== 0) return false;
 
-  if (state.tiles.length === 0 && state.phase !== "won") return false;
+  if (true) return false;
 
   if (state.phase === "playing") {
killedBy: Match Pile rules — reference & production spec R-GEN-SOLVABLE (seed=42) generates a solvable easy puzzle
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
game/match-pile/rules/isValid.ts:37:7
 
   if (state.cleared < 0 || state.cleared % MATCH_SIZE !== 0) return false;
 
-  if (state.tiles.length === 0 && state.phase !== "won") return false;
+  if (true && state.phase !== "won") return false;
 
   if (state.phase === "playing") {
killedBy: Match Pile rules — reference & production spec invariants — production step preserves rules invariants across a random walk, including terminal absorption (R-TERMINAL)
statusReason: Property failed after 1 tests
{ seed: -2040570474, path: "0:0:0:0:0:0:0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"tiles":[{"id":"t0","typeId":"A","col":0,"row":0,"layer":0}],"tray":[],"cleared":0,"phase":"playing"},[true,false,false,false,false,false,false,false,false,false],[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]]
Shrunk 33 time(s)

Hint: En

[Killed] ConditionalExpression
game/match-pile/rules/isValid.ts:39:7
 
   if (state.tiles.length === 0 && state.phase !== "won") return false;
 
-  if (state.phase === "playing") {
+  if (false) {
     if (state.tiles.length === 0) return false;
     if (state.tray.length === TRAY_SIZE) return false;
killedBy: Match Pile rules — reference & production spec isValid — rejects phase 'playing' with a full (TRAY_SIZE) tray
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
game/match-pile/rules/isValid.ts:39:34
 
   if (state.tiles.length === 0 && state.phase !== "won") return false;
 
-  if (state.phase === "playing") {
-    if (state.tiles.length === 0) return false;
-    if (state.tray.length === TRAY_SIZE) return false;
-  }
+  if (state.phase === "playing") {}
 
   return true;
killedBy: Match Pile rules — reference & production spec isValid — rejects phase 'playing' with a full (TRAY_SIZE) tray
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
game/match-pile/rules/isValid.ts:40:9
   if (state.tiles.length === 0 && state.phase !== "won") return false;
 
   if (state.phase === "playing") {
-    if (state.tiles.length === 0) return false;
+    if (true) return false;
     if (state.tray.length === TRAY_SIZE) return false;
   }
killedBy: Match Pile rules — reference & production spec invariants — production step preserves rules invariants across a random walk, including terminal absorption (R-TERMINAL)
statusReason: Property failed after 1 tests
{ seed: 1877224903, path: "0:1:0:0:1:1:1:1:2:2:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"tiles":[{"id":"t0","typeId":"A","col":0,"row":0,"layer":0},{"id":"t1","typeId":"A","col":0,"row":0,"layer":1}],"tray":[],"cleared":0,"phase":"playing"},[false,false,false,false,false,false,false,false,false,false],[0,0,0,0,

[Killed] EqualityOperator
game/match-pile/rules/isValid.ts:40:9
   if (state.tiles.length === 0 && state.phase !== "won") return false;
 
   if (state.phase === "playing") {
-    if (state.tiles.length === 0) return false;
+    if (state.tiles.length !== 0) return false;
     if (state.tray.length === TRAY_SIZE) return false;
   }
killedBy: Match Pile rules — reference & production spec invariants — production step preserves rules invariants across a random walk, including terminal absorption (R-TERMINAL)
statusReason: Property failed after 1 tests
{ seed: -1497380679, path: "0:0:0:0:0:0:0:0:0:0:1:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"tiles":[{"id":"t0","typeId":"A","col":0,"row":0,"layer":0}],"tray":[],"cleared":0,"phase":"playing"},[true,false,false,false,false,false,false,false,false,false],[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]]
Shrunk 31 time(s)

Hint: Enable

[Killed] ConditionalExpression
game/match-pile/rules/isValid.ts:41:9
 
   if (state.phase === "playing") {
     if (state.tiles.length === 0) return false;
-    if (state.tray.length === TRAY_SIZE) return false;
+    if (false) return false;
   }
 
killedBy: Match Pile rules — reference & production spec isValid — rejects phase 'playing' with a full (TRAY_SIZE) tray
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
game/match-pile/rules/isValid.ts:41:9
 
   if (state.phase === "playing") {
     if (state.tiles.length === 0) return false;
-    if (state.tray.length === TRAY_SIZE) return false;
+    if (true) return false;
   }
 
killedBy: Match Pile rules — reference & production spec invariants — production step preserves rules invariants across a random walk, including terminal absorption (R-TERMINAL)
statusReason: Property failed after 1 tests
{ seed: -1863439224, path: "0:0:0:0:0:0:0:0:1:0:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2:2", endOnFailure: true }
Counterexample: [{"tiles":[{"id":"t0","typeId":"A","col":0,"row":0,"layer":0}],"tray":[],"cleared":0,"phase":"playing"},[true,false,false,false,false,false,false,false,false,false,false],[0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0]]
Shrunk 31 time(s)

Hint:
