[Killed] BlockStatement
game/match-pile/rules/isExposed.ts:10:70
 
 import type { PileState } from "./types";
 
-export function isExposed(state: PileState, tileId: string): boolean {
-  const target = state.tiles.find((tile) => tile.id === tileId);
-  if (!target) return false;
-
-  for (const other of state.tiles) {
-    if (other.id === target.id) continue;
-    if (other.col === target.col && other.row === target.row && other.layer > target.layer) {
-      return false;
-    }
-  }
-
-  return true;
-}
+export function isExposed(state: PileState, tileId: string): boolean {}
 
killedBy: Match Pile rules — reference & production spec R-GEN-SOLVABLE (seed=42) generates a solvable easy puzzle
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
game/match-pile/rules/isExposed.ts:11:45
 import type { PileState } from "./types";
 
 export function isExposed(state: PileState, tileId: string): boolean {
-  const target = state.tiles.find((tile) => tile.id === tileId);
+  const target = state.tiles.find((tile) => tile.id !== tileId);
   if (!target) return false;
 
killedBy: D2 — every level solves under the production engine ftue-1
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
game/match-pile/rules/isExposed.ts:11:45
 import type { PileState } from "./types";
 
 export function isExposed(state: PileState, tileId: string): boolean {
-  const target = state.tiles.find((tile) => tile.id === tileId);
+  const target = state.tiles.find((tile) => false);
   if (!target) return false;
 
killedBy: D2 — every level solves under the production engine ftue-1
statusReason: expected 0 to be greater than or equal to 1

[Killed] BooleanLiteral
game/match-pile/rules/isExposed.ts:12:7
 
 export function isExposed(state: PileState, tileId: string): boolean {
   const target = state.tiles.find((tile) => tile.id === tileId);
-  if (!target) return false;
+  if (target) return false;
 
   for (const other of state.tiles) {
killedBy: D2 — every level solves under the production engine ftue-1
statusReason: expected 0 to be greater than or equal to 1

[Killed] BooleanLiteral
game/match-pile/rules/isExposed.ts:12:23
 
 export function isExposed(state: PileState, tileId: string): boolean {
   const target = state.tiles.find((tile) => tile.id === tileId);
-  if (!target) return false;
+  if (!target) return true;
 
   for (const other of state.tiles) {
killedBy: Match Pile rules — reference & production spec isExposed — returns false for a tile id absent from state.tiles (direct call, not only reachable via step())
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
game/match-pile/rules/isExposed.ts:14:36
   const target = state.tiles.find((tile) => tile.id === tileId);
   if (!target) return false;
 
-  for (const other of state.tiles) {
-    if (other.id === target.id) continue;
-    if (other.col === target.col && other.row === target.row && other.layer > target.layer) {
-      return false;
-    }
-  }
+  for (const other of state.tiles) {}
 
   return true;
killedBy: Match Pile rules — reference & production spec parity — referenceStep matches production step across randomly generated legal and illegal picks
statusReason: Property failed after 1 tests
{ seed: -1048781201, path: "0", endOnFailure: true }
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
game/match-pile/rules/isExposed.ts:15:9
   if (!target) return false;
 
   for (const other of state.tiles) {
-    if (other.id === target.id) continue;
+    if (other.id !== target.id) continue;
     if (other.col === target.col && other.row === target.row && other.layer > target.layer) {
       return false;
killedBy: Match Pile rules — reference & production spec parity — referenceStep matches production step across randomly generated legal and illegal picks
statusReason: Property failed after 21 tests
{ seed: 237662861, path: "20:9:2:2:7:7:10:7:7:1:2:2:2:0:0:0", endOnFailure: true }
Counterexample: [{"state":{"tiles":[{"id":"t0","typeId":"A","col":0,"row":0,"layer":0},{"id":"t1","typeId":"A","col":0,"row":0,"layer":1}],"tray":[],"cleared":0,"phase":"playing"},"pickId":"t0"}]
Shrunk 15 time(s)

Hint: Enable verbose mode in order to have the list of all failing valu

[Killed] ConditionalExpression
game/match-pile/rules/isExposed.ts:15:9
   if (!target) return false;
 
   for (const other of state.tiles) {
-    if (other.id === target.id) continue;
+    if (true) continue;
     if (other.col === target.col && other.row === target.row && other.layer > target.layer) {
       return false;
killedBy: Match Pile rules — reference & production spec parity — referenceStep matches production step across randomly generated legal and illegal picks
statusReason: Property failed after 1 tests
{ seed: 277643043, path: "0", endOnFailure: true }
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
game/match-pile/rules/isExposed.ts:16:9
 
   for (const other of state.tiles) {
     if (other.id === target.id) continue;
-    if (other.col === target.col && other.row === target.row && other.layer > target.layer) {
+    if (true) {
       return false;
     }
killedBy: Match Pile rules — reference & production spec R-GEN-SOLVABLE (seed=42) generates a solvable easy puzzle
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
game/match-pile/rules/isExposed.ts:16:9
 
   for (const other of state.tiles) {
     if (other.id === target.id) continue;
-    if (other.col === target.col && other.row === target.row && other.layer > target.layer) {
+    if (true && other.layer > target.layer) {
       return false;
     }
killedBy: Match Pile rules — reference & production spec parity — referenceStep matches production step across randomly generated legal and illegal picks
statusReason: Property failed after 9 tests
{ seed: -2011816247, path: "8:27", endOnFailure: true }
Shrunk 1 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
game/match-pile/rules/isExposed.ts:17:14
   for (const other of state.tiles) {
     if (other.id === target.id) continue;
     if (other.col === target.col && other.row === target.row && other.layer > target.layer) {
-      return false;
+      return true;
     }
   }
killedBy: Match Pile rules — reference & production spec parity — referenceStep matches production step across randomly generated legal and illegal picks
statusReason: Property failed after 5 tests
{ seed: 367084280, path: "4:1:6:9:0:3:3:6:6:0:0:0:0:0", endOnFailure: true }
Counterexample: [{"state":{"tiles":[{"id":"t0","typeId":"A","col":2,"row":0,"layer":0},{"id":"t1","typeId":"A","col":2,"row":0,"layer":1}],"tray":[],"cleared":0,"phase":"playing"},"pickId":"t0"}]
Shrunk 13 time(s)

Hint: Enable verbose mode in order to have the list of all failing values enco
