[Killed] ArithmeticOperator
game/match-pile/rules/rate.ts:47:22
 
   // Bounded by tile count + a small margin: each successful pick removes
   // exactly one tile, so this always terminates well before the cap.
-  const stepBudget = puzzle.tiles.length + 5;
+  const stepBudget = puzzle.tiles.length - 5;
 
   for (let i = 0; i < stepBudget && state.phase === "playing" && state.tiles.length > 0; i++) {
killedBy: Match Pile rules — reference & production spec rate — a single already-exposed tile: one naive-walk step, no clears, wins
statusReason: expected +0 to be close to 0.10142857142857142, received difference is 0.10142857142857142, but expected 5e-11

[Killed] ConditionalExpression
game/match-pile/rules/rate.ts:49:37
   // exactly one tile, so this always terminates well before the cap.
   const stepBudget = puzzle.tiles.length + 5;
 
-  for (let i = 0; i < stepBudget && state.phase === "playing" && state.tiles.length > 0; i++) {
+  for (let i = 0; i < stepBudget && true && state.tiles.length > 0; i++) {
     const exposed = state.tiles.filter((tile) => isExposed(state, tile.id));
     if (exposed.length === 0) break;
killedBy: Match Pile rules — reference & production spec rate — a deep, 8-type, single-layer puzzle the naive walk fails to clear (fail penalty fires)
statusReason: expected 0.7946153846153847 to be close to 0.8500000000000001, received difference is 0.055384615384615365, but expected 5e-11

[Killed] EqualityOperator
game/match-pile/rules/rate.ts:49:66
   // exactly one tile, so this always terminates well before the cap.
   const stepBudget = puzzle.tiles.length + 5;
 
-  for (let i = 0; i < stepBudget && state.phase === "playing" && state.tiles.length > 0; i++) {
+  for (let i = 0; i < stepBudget && state.phase === "playing" && state.tiles.length <= 0; i++) {
     const exposed = state.tiles.filter((tile) => isExposed(state, tile.id));
     if (exposed.length === 0) break;
killedBy: Match Pile rules — reference & production spec rate — a single already-exposed tile: one naive-walk step, no clears, wins
statusReason: expected +0 to be close to 0.10142857142857142, received difference is 0.10142857142857142, but expected 5e-11

[Killed] ArrowFunction
game/match-pile/rules/rate.ts:50:40
   const stepBudget = puzzle.tiles.length + 5;
 
   for (let i = 0; i < stepBudget && state.phase === "playing" && state.tiles.length > 0; i++) {
-    const exposed = state.tiles.filter((tile) => isExposed(state, tile.id));
+    const exposed = state.tiles.filter(() => undefined);
     if (exposed.length === 0) break;
 
killedBy: Match Pile rules — reference & production spec rate — a single already-exposed tile: one naive-walk step, no clears, wins
statusReason: expected +0 to be close to 0.10142857142857142, received difference is 0.10142857142857142, but expected 5e-11

[Killed] MethodExpression
game/match-pile/rules/rate.ts:50:21
   const stepBudget = puzzle.tiles.length + 5;
 
   for (let i = 0; i < stepBudget && state.phase === "playing" && state.tiles.length > 0; i++) {
-    const exposed = state.tiles.filter((tile) => isExposed(state, tile.id));
+    const exposed = state.tiles;
     if (exposed.length === 0) break;
 
killedBy: Match Pile rules — reference & production spec rate — a 2-layer stack: the naive walk must use isExposed(), not the raw tile list
statusReason: expected 0.13142857142857142 to be close to 0.17285714285714285, received difference is 0.041428571428571426, but expected 5e-11

[Killed] ConditionalExpression
game/match-pile/rules/rate.ts:51:9
 
   for (let i = 0; i < stepBudget && state.phase === "playing" && state.tiles.length > 0; i++) {
     const exposed = state.tiles.filter((tile) => isExposed(state, tile.id));
-    if (exposed.length === 0) break;
+    if (true) break;
 
     const distinctExposedTypes = new Set(exposed.map((tile) => tile.typeId)).size;
killedBy: Match Pile rules — reference & production spec rate — a single already-exposed tile: one naive-walk step, no clears, wins
statusReason: expected +0 to be close to 0.10142857142857142, received difference is 0.10142857142857142, but expected 5e-11

[Killed] EqualityOperator
game/match-pile/rules/rate.ts:51:9
 
   for (let i = 0; i < stepBudget && state.phase === "playing" && state.tiles.length > 0; i++) {
     const exposed = state.tiles.filter((tile) => isExposed(state, tile.id));
-    if (exposed.length === 0) break;
+    if (exposed.length !== 0) break;
 
     const distinctExposedTypes = new Set(exposed.map((tile) => tile.typeId)).size;
killedBy: Match Pile rules — reference & production spec rate — a single already-exposed tile: one naive-walk step, no clears, wins
statusReason: expected +0 to be close to 0.10142857142857142, received difference is 0.10142857142857142, but expected 5e-11

[Killed] ArrowFunction
game/match-pile/rules/rate.ts:53:54
     const exposed = state.tiles.filter((tile) => isExposed(state, tile.id));
     if (exposed.length === 0) break;
 
-    const distinctExposedTypes = new Set(exposed.map((tile) => tile.typeId)).size;
+    const distinctExposedTypes = new Set(exposed.map(() => undefined)).size;
     branchingSum += distinctExposedTypes;
     branchingSamples += 1;
killedBy: Match Pile rules — reference & production spec rate — a shallow, 2-type, single-layer puzzle that fully clears via the naive walk
statusReason: expected 0.3871428571428571 to be close to 0.41214285714285714, received difference is 0.025000000000000022, but expected 5e-11

[Killed] AssignmentOperator
game/match-pile/rules/rate.ts:54:5
     if (exposed.length === 0) break;
 
     const distinctExposedTypes = new Set(exposed.map((tile) => tile.typeId)).size;
-    branchingSum += distinctExposedTypes;
+    branchingSum -= distinctExposedTypes;
     branchingSamples += 1;
 
killedBy: Match Pile rules — reference & production spec rate — a single already-exposed tile: one naive-walk step, no clears, wins
statusReason: expected 0.041428571428571426 to be close to 0.10142857142857142, received difference is 0.06, but expected 5e-11

[Killed] AssignmentOperator
game/match-pile/rules/rate.ts:55:5
 
     const distinctExposedTypes = new Set(exposed.map((tile) => tile.typeId)).size;
     branchingSum += distinctExposedTypes;
-    branchingSamples += 1;
+    branchingSamples -= 1;
 
     let pick = exposed[0];
killedBy: Match Pile rules — reference & production spec rate — a single already-exposed tile: one naive-walk step, no clears, wins
statusReason: expected 0.07142857142857142 to be close to 0.10142857142857142, received difference is 0.03, but expected 5e-11

[Killed] BlockStatement
game/match-pile/rules/rate.ts:58:33
     branchingSamples += 1;
 
     let pick = exposed[0];
-    for (const tile of exposed) {
-      if (tile.col < pick.col || (tile.col === pick.col && tile.row < pick.row)) {
-        pick = tile;
-      }
-    }
+    for (const tile of exposed) {}
 
     const preInsertOccupancy = state.tray.length + 1;
killedBy: Match Pile rules — reference & production spec rate — a shallow, 2-type, single-layer puzzle that fully clears via the naive walk
statusReason: expected 0.2592857142857143 to be close to 0.41214285714285714, received difference is 0.15285714285714286, but expected 5e-11

[Killed] ConditionalExpression
game/match-pile/rules/rate.ts:59:11
 
     let pick = exposed[0];
     for (const tile of exposed) {
-      if (tile.col < pick.col || (tile.col === pick.col && tile.row < pick.row)) {
+      if (false) {
         pick = tile;
       }
killedBy: Match Pile rules — reference & production spec rate — a shallow, 2-type, single-layer puzzle that fully clears via the naive walk
statusReason: expected 0.2592857142857143 to be close to 0.41214285714285714, received difference is 0.15285714285714286, but expected 5e-11

[Killed] ConditionalExpression
game/match-pile/rules/rate.ts:59:11
 
     let pick = exposed[0];
     for (const tile of exposed) {
-      if (tile.col < pick.col || (tile.col === pick.col && tile.row < pick.row)) {
+      if (false || (tile.col === pick.col && tile.row < pick.row)) {
         pick = tile;
       }
killedBy: Match Pile rules — reference & production spec rate — a shallow, 2-type, single-layer puzzle that fully clears via the naive walk
statusReason: expected 0.2592857142857143 to be close to 0.41214285714285714, received difference is 0.15285714285714286, but expected 5e-11

[Killed] ArithmeticOperator
game/match-pile/rules/rate.ts:64:32
       }
     }
 
-    const preInsertOccupancy = state.tray.length + 1;
+    const preInsertOccupancy = state.tray.length - 1;
     if (preInsertOccupancy > maxTrayOccupancy) {
       maxTrayOccupancy = preInsertOccupancy;
killedBy: Match Pile rules — reference & production spec rate — a single already-exposed tile: one naive-walk step, no clears, wins
statusReason: expected 0.03 to be close to 0.10142857142857142, received difference is 0.07142857142857142, but expected 5e-11

[Killed] ConditionalExpression
game/match-pile/rules/rate.ts:65:9
     }
 
     const preInsertOccupancy = state.tray.length + 1;
-    if (preInsertOccupancy > maxTrayOccupancy) {
+    if (false) {
       maxTrayOccupancy = preInsertOccupancy;
     }
killedBy: Match Pile rules — reference & production spec rate — a single already-exposed tile: one naive-walk step, no clears, wins
statusReason: expected 0.03 to be close to 0.10142857142857142, received difference is 0.07142857142857142, but expected 5e-11

[Killed] ConditionalExpression
game/match-pile/rules/rate.ts:65:9
     }
 
     const preInsertOccupancy = state.tray.length + 1;
-    if (preInsertOccupancy > maxTrayOccupancy) {
+    if (true) {
       maxTrayOccupancy = preInsertOccupancy;
     }
killedBy: Match Pile rules — reference & production spec rate — a shallow, 2-type, single-layer puzzle that fully clears via the naive walk
statusReason: expected 0.26928571428571424 to be close to 0.41214285714285714, received difference is 0.1428571428571429, but expected 5e-11

[Killed] ArithmeticOperator
game/match-pile/rules/rate.ts:72:35
     state = step(state, pick.id);
   }
 
-  const occupancyScore = Math.min(maxTrayOccupancy / TRAY_SIZE, 1);
+  const occupancyScore = Math.min(maxTrayOccupancy * TRAY_SIZE, 1);
   const avgBranching = branchingSamples > 0 ? branchingSum / branchingSamples : 0;
   const branchingScore = Math.min(avgBranching / MAX_EXPECTED_BRANCHING, 1);
killedBy: Match Pile rules — reference & production spec rate — a single already-exposed tile: one naive-walk step, no clears, wins
statusReason: expected 0.53 to be close to 0.10142857142857142, received difference is 0.4285714285714286, but expected 5e-11

[Killed] MethodExpression
game/match-pile/rules/rate.ts:72:26
     state = step(state, pick.id);
   }
 
-  const occupancyScore = Math.min(maxTrayOccupancy / TRAY_SIZE, 1);
+  const occupancyScore = Math.max(maxTrayOccupancy / TRAY_SIZE, 1);
   const avgBranching = branchingSamples > 0 ? branchingSum / branchingSamples : 0;
   const branchingScore = Math.min(avgBranching / MAX_EXPECTED_BRANCHING, 1);
killedBy: Match Pile rules — reference & production spec rate — a single already-exposed tile: one naive-walk step, no clears, wins
statusReason: expected 0.53 to be close to 0.10142857142857142, received difference is 0.4285714285714286, but expected 5e-11

[Killed] EqualityOperator
game/match-pile/rules/rate.ts:73:24
   }
 
   const occupancyScore = Math.min(maxTrayOccupancy / TRAY_SIZE, 1);
-  const avgBranching = branchingSamples > 0 ? branchingSum / branchingSamples : 0;
+  const avgBranching = branchingSamples <= 0 ? branchingSum / branchingSamples : 0;
   const branchingScore = Math.min(avgBranching / MAX_EXPECTED_BRANCHING, 1);
   const failPenalty = state.phase === "lost" ? 1 : 0;
killedBy: Match Pile rules — reference & production spec rate — a single already-exposed tile: one naive-walk step, no clears, wins
statusReason: expected 0.07142857142857142 to be close to 0.10142857142857142, received difference is 0.03, but expected 5e-11

[Killed] ConditionalExpression
game/match-pile/rules/rate.ts:73:24
   }
 
   const occupancyScore = Math.min(maxTrayOccupancy / TRAY_SIZE, 1);
-  const avgBranching = branchingSamples > 0 ? branchingSum / branchingSamples : 0;
+  const avgBranching = true ? branchingSum / branchingSamples : 0;
   const branchingScore = Math.min(avgBranching / MAX_EXPECTED_BRANCHING, 1);
   const failPenalty = state.phase === "lost" ? 1 : 0;
killedBy: Match Pile rules — reference & production spec rate — an already-cleared (empty) puzzle scores exactly 0 (branchingSamples===0 edge case)
statusReason: expected NaN to be +0 // Object.is equality

[Killed] ArithmeticOperator
game/match-pile/rules/rate.ts:74:35
 
   const occupancyScore = Math.min(maxTrayOccupancy / TRAY_SIZE, 1);
   const avgBranching = branchingSamples > 0 ? branchingSum / branchingSamples : 0;
-  const branchingScore = Math.min(avgBranching / MAX_EXPECTED_BRANCHING, 1);
+  const branchingScore = Math.min(avgBranching * MAX_EXPECTED_BRANCHING, 1);
   const failPenalty = state.phase === "lost" ? 1 : 0;
 
killedBy: Match Pile rules — reference & production spec rate — a single already-exposed tile: one naive-walk step, no clears, wins
statusReason: expected 0.37142857142857144 to be close to 0.10142857142857142, received difference is 0.27, but expected 5e-11

[Killed] MethodExpression
game/match-pile/rules/rate.ts:74:26
 
   const occupancyScore = Math.min(maxTrayOccupancy / TRAY_SIZE, 1);
   const avgBranching = branchingSamples > 0 ? branchingSum / branchingSamples : 0;
-  const branchingScore = Math.min(avgBranching / MAX_EXPECTED_BRANCHING, 1);
+  const branchingScore = Math.max(avgBranching / MAX_EXPECTED_BRANCHING, 1);
   const failPenalty = state.phase === "lost" ? 1 : 0;
 
killedBy: Match Pile rules — reference & production spec rate — a single already-exposed tile: one naive-walk step, no clears, wins
statusReason: expected 0.37142857142857144 to be close to 0.10142857142857142, received difference is 0.27, but expected 5e-11

[Killed] ConditionalExpression
game/match-pile/rules/rate.ts:75:23
   const occupancyScore = Math.min(maxTrayOccupancy / TRAY_SIZE, 1);
   const avgBranching = branchingSamples > 0 ? branchingSum / branchingSamples : 0;
   const branchingScore = Math.min(avgBranching / MAX_EXPECTED_BRANCHING, 1);
-  const failPenalty = state.phase === "lost" ? 1 : 0;
+  const failPenalty = false ? 1 : 0;
 
   return occupancyScore * 0.5 + branchingScore * 0.3 + failPenalty * 0.2;
killedBy: Match Pile rules — reference & production spec rate — a deep, 8-type, single-layer puzzle the naive walk fails to clear (fail penalty fires)
statusReason: expected 0.65 to be close to 0.8500000000000001, received difference is 0.20000000000000007, but expected 5e-11

[Killed] ConditionalExpression
game/match-pile/rules/rate.ts:75:23
   const occupancyScore = Math.min(maxTrayOccupancy / TRAY_SIZE, 1);
   const avgBranching = branchingSamples > 0 ? branchingSum / branchingSamples : 0;
   const branchingScore = Math.min(avgBranching / MAX_EXPECTED_BRANCHING, 1);
-  const failPenalty = state.phase === "lost" ? 1 : 0;
+  const failPenalty = true ? 1 : 0;
 
   return occupancyScore * 0.5 + branchingScore * 0.3 + failPenalty * 0.2;
killedBy: Match Pile rules — reference & production spec rate — a single already-exposed tile: one naive-walk step, no clears, wins
statusReason: expected 0.30142857142857143 to be close to 0.10142857142857142, received difference is 0.2, but expected 5e-11

[Killed] ArithmeticOperator
game/match-pile/rules/rate.ts:77:33
   const branchingScore = Math.min(avgBranching / MAX_EXPECTED_BRANCHING, 1);
   const failPenalty = state.phase === "lost" ? 1 : 0;
 
-  return occupancyScore * 0.5 + branchingScore * 0.3 + failPenalty * 0.2;
+  return occupancyScore * 0.5 + branchingScore / 0.3 + failPenalty * 0.2;
 }
 
killedBy: Match Pile rules — reference & production spec rate — a single already-exposed tile: one naive-walk step, no clears, wins
statusReason: expected 0.40476190476190477 to be close to 0.10142857142857142, received difference is 0.30333333333333334, but expected 5e-11

[Killed] ArithmeticOperator
game/match-pile/rules/rate.ts:77:10
   const branchingScore = Math.min(avgBranching / MAX_EXPECTED_BRANCHING, 1);
   const failPenalty = state.phase === "lost" ? 1 : 0;
 
-  return occupancyScore * 0.5 + branchingScore * 0.3 + failPenalty * 0.2;
+  return occupancyScore * 0.5 + branchingScore * 0.3 - failPenalty * 0.2;
 }
 
killedBy: Match Pile rules — reference & production spec rate — a deep, 8-type, single-layer puzzle the naive walk fails to clear (fail penalty fires)
statusReason: expected 0.45 to be close to 0.8500000000000001, received difference is 0.4000000000000001, but expected 5e-11
