[Killed] BlockStatement
game/match-pile/rules/step.ts:15:89
 import { winFail } from "./winFail";
 
 /** Removes the first `count` occurrences of `typeId` from `tray`, preserving order of what remains. */
-function removeFirstN(tray: readonly string[], typeId: string, count: number): string[] {
-  const result: string[] = [];
-  let remaining = count;
-  for (const entry of tray) {
-    if (entry === typeId && remaining > 0) {
-      remaining -= 1;
-      continue;
-    }
-    result.push(entry);
-  }
-  return result;
-}
+function removeFirstN(tray: readonly string[], typeId: string, count: number): string[] {}
 
 /**
killedBy: Match Pile rules — reference & production spec R-HINT (seed=7) explain() only ever names an exposed tile
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
game/match-pile/rules/step.ts:18:29
 function removeFirstN(tray: readonly string[], typeId: string, count: number): string[] {
   const result: string[] = [];
   let remaining = count;
-  for (const entry of tray) {
-    if (entry === typeId && remaining > 0) {
-      remaining -= 1;
-      continue;
-    }
-    result.push(entry);
-  }
+  for (const entry of tray) {}
   return result;
 }
killedBy: Match Pile rules — reference & production spec parity — referenceStep matches production step across randomly generated legal and illegal picks
statusReason: Property failed after 14 tests
{ seed: -936525856, path: "13:0:0:0:2:3", endOnFailure: true }
Counterexample: [{"state":{"tiles":[{"id":"t0","typeId":"A","col":0,"row":0,"layer":0}],"tray":["A","A","D"],"cleared":0,"phase":"playing"},"pickId":"t0"}]
Shrunk 5 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
game/match-pile/rules/step.ts:19:9
   const result: string[] = [];
   let remaining = count;
   for (const entry of tray) {
-    if (entry === typeId && remaining > 0) {
+    if (false) {
       remaining -= 1;
       continue;
killedBy: Match Pile rules — reference & production spec R-GEN-SOLVABLE (seed=42) generates a solvable easy puzzle
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
game/match-pile/rules/step.ts:19:29
   const result: string[] = [];
   let remaining = count;
   for (const entry of tray) {
-    if (entry === typeId && remaining > 0) {
+    if (entry === typeId && remaining >= 0) {
       remaining -= 1;
       continue;
killedBy: Match Pile rules — reference & production spec step — auto-clear removes exactly MATCH_SIZE occurrences of the picked type, preserving other entries and leaving extras behind
statusReason: expected [ 'B' ] to deeply equal [ 'B', 'A' ]

[Killed] AssignmentOperator
game/match-pile/rules/step.ts:20:7
   let remaining = count;
   for (const entry of tray) {
     if (entry === typeId && remaining > 0) {
-      remaining -= 1;
+      remaining += 1;
       continue;
     }
killedBy: Match Pile rules — reference & production spec step — auto-clear removes exactly MATCH_SIZE occurrences of the picked type, preserving other entries and leaving extras behind
statusReason: expected [ 'B' ] to deeply equal [ 'B', 'A' ]

[Killed] CallExpression
game/match-pile/rules/step.ts:23:5
       remaining -= 1;
       continue;
     }
-    result.push(entry);
+    ;
   }
   return result;
killedBy: Match Pile rules — reference & production spec parity — referenceStep matches production step across randomly generated legal and illegal picks
statusReason: Property failed after 19 tests
{ seed: -122101630, path: "18:0:0:0:2:3:3", endOnFailure: true }
Counterexample: [{"state":{"tiles":[{"id":"t0","typeId":"A","col":0,"row":0,"layer":0}],"tray":["A","A","D"],"cleared":0,"phase":"playing"},"pickId":"t0"}]
Shrunk 6 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ConditionalExpression
game/match-pile/rules/step.ts:34:7
  * same `state` reference.
  */
 export function step(state: PileState, tileId: string): PileState {
-  if (state.phase !== "playing") {
+  if (false) {
     return state;
   }
killedBy: Match Pile rules — reference & production spec invariants — production step preserves rules invariants across a random walk, including terminal absorption (R-TERMINAL)
statusReason: Property failed after 3 tests
{ seed: 1038469673, path: "2:37:4:3:3:4:4:3:3:3:3:3:3:3:9:6:3:3:3:3:3:3:3:3:3:3:3:3:3:3:3", endOnFailure: true }
Shrunk 30 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] EqualityOperator
game/match-pile/rules/step.ts:34:7
  * same `state` reference.
  */
 export function step(state: PileState, tileId: string): PileState {
-  if (state.phase !== "playing") {
+  if (state.phase === "playing") {
     return state;
   }
killedBy: Match Pile rules — reference & production spec R-HINT (seed=7) explain() only ever names an exposed tile
statusReason: Maximum call stack size exceeded

[Killed] ConditionalExpression
game/match-pile/rules/step.ts:38:45
     return state;
   }
 
-  const picked = state.tiles.find((tile) => tile.id === tileId);
+  const picked = state.tiles.find((tile) => true);
   if (!picked) {
     return state;
killedBy: Match Pile rules — reference & production spec parity — referenceStep matches production step across randomly generated legal and illegal picks
statusReason: Property failed after 1 tests
{ seed: 1999719271, path: "0", endOnFailure: true }
Counterexample: [{"state":{"tiles":[{"id":"t0","typeId":"A","col":2,"row":2,"layer":0},{"id":"t1","typeId":"D","col":1,"row":0,"layer":0}],"tray":["A","B","C","D","D"],"cleared":0,"phase":"playing"},"pickId":"t1"}]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered

[Killed] ArrowFunction
game/match-pile/rules/step.ts:38:35
     return state;
   }
 
-  const picked = state.tiles.find((tile) => tile.id === tileId);
+  const picked = state.tiles.find(() => undefined);
   if (!picked) {
     return state;
killedBy: Match Pile rules — reference & production spec R-HINT (seed=7) explain() only ever names an exposed tile
statusReason: Maximum call stack size exceeded

[Killed] BooleanLiteral
game/match-pile/rules/step.ts:39:7
   }
 
   const picked = state.tiles.find((tile) => tile.id === tileId);
-  if (!picked) {
+  if (picked) {
     return state;
   }
killedBy: Match Pile rules — reference & production spec R-HINT (seed=7) explain() only ever names an exposed tile
statusReason: Maximum call stack size exceeded

[Killed] ConditionalExpression
game/match-pile/rules/step.ts:39:7
   }
 
   const picked = state.tiles.find((tile) => tile.id === tileId);
-  if (!picked) {
+  if (true) {
     return state;
   }
killedBy: Match Pile rules — reference & production spec R-HINT (seed=7) explain() only ever names an exposed tile
statusReason: Maximum call stack size exceeded

[Killed] ConditionalExpression
game/match-pile/rules/step.ts:43:7
     return state;
   }
 
-  if (!isExposed(state, tileId)) {
+  if (false) {
     return state;
   }
killedBy: Match Pile rules — reference & production spec parity — referenceStep matches production step across randomly generated legal and illegal picks
statusReason: Property failed after 12 tests
{ seed: 1769336227, path: "11", endOnFailure: true }
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] BooleanLiteral
game/match-pile/rules/step.ts:43:7
     return state;
   }
 
-  if (!isExposed(state, tileId)) {
+  if (isExposed(state, tileId)) {
     return state;
   }
killedBy: Match Pile rules — reference & production spec R-HINT (seed=7) explain() only ever names an exposed tile
statusReason: Maximum call stack size exceeded

[Killed] ConditionalExpression
game/match-pile/rules/step.ts:47:55
     return state;
   }
 
-  const remainingTiles = state.tiles.filter((tile) => tile.id !== tileId);
+  const remainingTiles = state.tiles.filter((tile) => true);
   const trayWithPick = [...state.tray, picked.typeId];
 
killedBy: Match Pile rules — reference & production spec R-HINT (seed=7) explain() only ever names an exposed tile
statusReason: Maximum call stack size exceeded

[Killed] MethodExpression
game/match-pile/rules/step.ts:47:26
     return state;
   }
 
-  const remainingTiles = state.tiles.filter((tile) => tile.id !== tileId);
+  const remainingTiles = state.tiles;
   const trayWithPick = [...state.tray, picked.typeId];
 
killedBy: Match Pile rules — reference & production spec R-HINT (seed=7) explain() only ever names an exposed tile
statusReason: Maximum call stack size exceeded

[Killed] BlockStatement
game/match-pile/rules/step.ts:51:37
   const trayWithPick = [...state.tray, picked.typeId];
 
   let occurrences = 0;
-  for (const entry of trayWithPick) {
-    if (entry === picked.typeId) occurrences += 1;
-  }
+  for (const entry of trayWithPick) {}
 
   let nextTray = trayWithPick;
killedBy: Match Pile rules — reference & production spec R-GEN-SOLVABLE (seed=42) generates a solvable easy puzzle
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
game/match-pile/rules/step.ts:52:9
 
   let occurrences = 0;
   for (const entry of trayWithPick) {
-    if (entry === picked.typeId) occurrences += 1;
+    if (false) occurrences += 1;
   }
 
killedBy: Match Pile rules — reference & production spec R-GEN-SOLVABLE (seed=42) generates a solvable easy puzzle
statusReason: expected 0 to be greater than or equal to 1

[Killed] ConditionalExpression
game/match-pile/rules/step.ts:52:9
 
   let occurrences = 0;
   for (const entry of trayWithPick) {
-    if (entry === picked.typeId) occurrences += 1;
+    if (true) occurrences += 1;
   }
 
killedBy: Match Pile rules — reference & production spec R-FAIL (seed=1) a losing pick sequence reaches phase lost
statusReason: expected 'playing' to be 'lost' // Object.is equality

[Killed] EqualityOperator
game/match-pile/rules/step.ts:60:7
 
   // R-AUTOCLEAR: the pick just made can be the only typeId to have reached
   // MATCH_SIZE (every prior state holds each typeId below the threshold).
-  if (occurrences >= MATCH_SIZE) {
+  if (occurrences < MATCH_SIZE) {
     nextTray = removeFirstN(trayWithPick, picked.typeId, MATCH_SIZE);
     cleared += MATCH_SIZE;
killedBy: Match Pile rules — reference & production spec R-FAIL (seed=1) a losing pick sequence reaches phase lost
statusReason: expected 'playing' to be 'lost' // Object.is equality

[Killed] EqualityOperator
game/match-pile/rules/step.ts:60:7
 
   // R-AUTOCLEAR: the pick just made can be the only typeId to have reached
   // MATCH_SIZE (every prior state holds each typeId below the threshold).
-  if (occurrences >= MATCH_SIZE) {
+  if (occurrences > MATCH_SIZE) {
     nextTray = removeFirstN(trayWithPick, picked.typeId, MATCH_SIZE);
     cleared += MATCH_SIZE;
killedBy: Match Pile rules — reference & production spec R-GEN-SOLVABLE (seed=42) generates a solvable easy puzzle
statusReason: expected 0 to be greater than or equal to 1

[Killed] AssignmentOperator
game/match-pile/rules/step.ts:62:5
   // MATCH_SIZE (every prior state holds each typeId below the threshold).
   if (occurrences >= MATCH_SIZE) {
     nextTray = removeFirstN(trayWithPick, picked.typeId, MATCH_SIZE);
-    cleared += MATCH_SIZE;
+    cleared -= MATCH_SIZE;
   }
 
killedBy: Match Pile rules — reference & production spec R-GEN-SOLVABLE (seed=42) generates a solvable easy puzzle
statusReason: expected false to be true // Object.is equality
