[Killed] BlockStatement
game/match-pile/rules/winFail.ts:10:81
 import type { Tile, Phase } from "./types";
 import { TRAY_SIZE } from "./types";
 
-export function winFail(tiles: readonly Tile[], tray: readonly string[]): Phase {
-  if (tiles.length === 0) return "won";
-  if (tray.length >= TRAY_SIZE) return "lost";
-  return "playing";
-}
+export function winFail(tiles: readonly Tile[], tray: readonly string[]): Phase {}
 
killedBy: Match Pile rules — reference & production spec R-HINT (seed=7) explain() only ever names an exposed tile
statusReason: Maximum call stack size exceeded

[Killed] EqualityOperator
game/match-pile/rules/winFail.ts:11:7
 import { TRAY_SIZE } from "./types";
 
 export function winFail(tiles: readonly Tile[], tray: readonly string[]): Phase {
-  if (tiles.length === 0) return "won";
+  if (tiles.length !== 0) return "won";
   if (tray.length >= TRAY_SIZE) return "lost";
   return "playing";
killedBy: Match Pile rules — reference & production spec R-GEN-SOLVABLE (seed=42) generates a solvable easy puzzle
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
game/match-pile/rules/winFail.ts:11:7
 import { TRAY_SIZE } from "./types";
 
 export function winFail(tiles: readonly Tile[], tray: readonly string[]): Phase {
-  if (tiles.length === 0) return "won";
+  if (true) return "won";
   if (tray.length >= TRAY_SIZE) return "lost";
   return "playing";
killedBy: Match Pile rules — reference & production spec R-GEN-SOLVABLE (seed=42) generates a solvable easy puzzle
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
game/match-pile/rules/winFail.ts:12:7
 
 export function winFail(tiles: readonly Tile[], tray: readonly string[]): Phase {
   if (tiles.length === 0) return "won";
-  if (tray.length >= TRAY_SIZE) return "lost";
+  if (tray.length < TRAY_SIZE) return "lost";
   return "playing";
 }
killedBy: Match Pile rules — reference & production spec R-GEN-SOLVABLE (seed=42) generates a solvable easy puzzle
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
game/match-pile/rules/winFail.ts:12:7
 
 export function winFail(tiles: readonly Tile[], tray: readonly string[]): Phase {
   if (tiles.length === 0) return "won";
-  if (tray.length >= TRAY_SIZE) return "lost";
+  if (tray.length > TRAY_SIZE) return "lost";
   return "playing";
 }
killedBy: Match Pile rules — reference & production spec R-FAIL (seed=1) a losing pick sequence reaches phase lost
statusReason: expected 'playing' to be 'lost' // Object.is equality

[Killed] StringLiteral
game/match-pile/rules/winFail.ts:13:10
 export function winFail(tiles: readonly Tile[], tray: readonly string[]): Phase {
   if (tiles.length === 0) return "won";
   if (tray.length >= TRAY_SIZE) return "lost";
-  return "playing";
+  return "";
 }
 
killedBy: Match Pile rules — reference & production spec R-HINT (seed=7) explain() only ever names an exposed tile
statusReason: Maximum call stack size exceeded
